Repository: OSLL/geo2tag
Catalog: src/unixODBC-2.2.11/gODBCConfig/po/gODBCConfig.*.po
Languages: sk

source: gODBCConfig - ODBC Data Source Administrator
sk: gODBCConfig - ODBC Administrátor Zdrojov Dát

source: Add
sk: Vlo¾i»

source: Remove
sk: Odstráni»

source: Configure...
sk: Nastavi»...

source: User data source configuration is stored in your home directory. This allows you configure data access without having to be system administrator
sk: Zdroj u¾ívateµskej konfigurácie je umiestnený vo va¹om domovskom adresári. To vám dovoµuje nastavi» prístup k dátam bez toho, aby ste boli systémovým administrátorom.

source: Name
sk: Meno

source: Description
sk: Popis

source: Driver
sk: Ovládaè

source: User DSN
sk: U¾ívateµský DSN

source: System data sources are shared among all users of this machine.These data sources may also be used by system services. Only the administrator can configure system data sources.
sk: Systémové zdroje dát sú zdieµané medzi v¹etkými u¾ívateeµmi tohoto PC. Tieto zdroje dát mô¾u by» tie¾ pou¾ité systémovými servismi. Iba administrátor mô¾e nastavi» systémovézdroje dát.

source: System DSN
sk: Systémový DSN

source: These drivers facilitate communication between the Driver Manager and the data server. Many ODBC drivers for Linux can be downloaded from the Internet while others are obtained from your database vendor.
sk: Tieto ovládaèe umo¾òujú komunikáciu medzi Mana¾érom Ovládaèov a dátovým servrom. Veµa ODBC ovládaèov pre Linux mô¾e by» stiahnutých z Internetu pokým iné sú dodávanéva¹ím dodávateµom databáz.

source: Driver Lib
sk: Kni¾nica Ovládaèa

source: Setup Lib
sk: Kni¾nica Nastavenia

source: Drivers
sk: Ovládaèe

source: Tracing allows you to create logs of the calls to ODBC drivers. Great for support people, or to aid you in debugging applications. You must be 'root' to set
sk: Trasovanie vám dovoµuje vytvori» logovacie súbory volaní ODBC ovládaèov. Dobré hlavne pre podpour; alebo ako pomôcka pri ladení programov. Musíte by» 'root'.

source: Browse
sk: Prechádza»...

source: Trace File
sk: Trasovací Súbor

source: Tracing On
sk: Trasovanie Zapnuté

source: Tracing
sk: Trasovanie

source: Open DataBase Connectivity (ODBC) was developed to be an Open and portable standard for accessing data. unixODBC implements this standard for Linux/UNIX.
sk: Open DataBase Connectivity (ODBC) bol vytvorený ako Otvorený a prenositeµný ¹tandard pre prístup k dátam. unixODBC zavádza tento ¹tandard pre Linux/UNIX.

source: Database System
sk: Databázový Systém

source: Credits
sk: Poskytuje

source: Application
sk: Program

source: Driver Manager
sk: Mana¾ér Ovládaèov

source: Config
sk: Konfigurátor

source: About
sk: O programe

source: gODBCConfig - Appication
sk: gODBCConfig - Program

source: The Application communicates with the Driver Manager using the standard ODBC calls. The application does not care; where the data is stored, how it is stored, or even how the system is configured to access the data. The Application only needs to know the data source name (DSN) The Application is not hard wired to a particular database system. This allows the user to select a different database system using the ODBCConfig Tool.
sk: Program komunikuje s Mana¾érom Dát pou¾ívajúcim ¹tand ODBC volaní. Program sa nestará; kde sú dáta ulo¾ené, ako sú ulo¾ené, alebo ako je nastavený systém k prístupu k dátam. Program potrebuje vedie» iba meno zdroja dát (DSN) Program nie je závislý na príslu¹nom databázovom systéme. To dovoµuje u¾ívateµovi vybra» si ODBCConfig ako nástroj pre rôzne databázové systémy.

source: gODBCConfig - Driver Manager
sk: gODBCConfig - Mana¾ér Ovládaèov

source: The Driver Manager carries out a number of functions, such as: 1. Resolve data source names via odbcinst lib) 2. Loads any required drivers 3. Calls the drivers exposed functions to communicate with the database. Some functionality, such as listing all Data Source, is only present in the Driver Manager or via odbcinst lib).
sk: Mana¾ér Ovládaèov uskutoèòuje rôzne funkcie, ako: 1. Rozlo¾i» názvy zdrojov dát prostredníctvom odbcinst lib) 2. Nahráva» potrebné ovládaèe 3. Vola» funkcie ovládaèov pre komunikáciu s databázou.Niektoré funkcie ako listova» v¹etky Zdroje Dát, sú poskytovanéiba Mana¾érom Ovládaèov alebo prostredníctvom odbcinst lib).

source: ODBCConfig - Drivers
sk: ODBCConfig - Ovládaèe

source: The ODBC Drivers contain code specific to a Database System and provides a set of callable functions to the Driver Manager. Drivers may implement some database functionality when it is required by ODBC and is not present in the Database System. Drivers may also translate data types. ODBC Drivers can be obtained from the Internet or directly from the Database vendor. Check http://www.unixodbc.org for drivers
sk: ODBC Ovládaèe poskytujú kód ¹pecifický Databázovému Systému a poskytujú sadu kompatibilných funkcií Mana¾éru Ovládaèov. Ovládaèe mô¾u obsahova» niektoré databázové funkcie, ktoré sú potrebnépre ODBC a nie sú prítomné v Databázovom Systéme. Ovládaèe mô¾u tie¾ preklada» dátové typy. ODBC Ovládaèe mô¾u by» stiahnuté z Internetu alebo ich mô¾ete obdr¾a»od dodávateµa va¹ej databáze. Prezrite si http://www.unixodbc.org ak chcete získa» nové ovládaèe.

source: ODBCConfig - Database Systems
sk: ODBCConfig - Databázové Systémy

source: Perhaps the most common type of Database System today is an SQL Server SQL Servers with Heavy Functionality ADABAS-D Empress Sybase - www.sybase.com Oracle - www.oracle.com SQL Servers with Lite Functionality MiniSQL MySQL Solid The Database System may be running on the local machine or on a remote machine. It may also store its information in a variety of ways. This does not matter to an ODBC application because the Driver Manager and the Driver provides a consistent interface to the Database System.
sk: Pravdepodobne najpou¾ívanej¹í typ Databázového Systému je v súèasnosti SQL Server SQL Server s Výbornou Funkènos»ou ADABAS-D Empress Sybase - www.sybase.com Oracle - www.oracle.com SQL Server s Dostatoènou Funkènos»ou MiniSQL MySQL Solid Databázový Systém mô¾e ís» na lokálnom alebo na vzdialenom stroji. Takisto mô¾e zoskupova» vlastné informácie rôznymi spôsobmi. To v¹ak nezaujíma ODBC porgramy, nakoµko Mana¾ér Ovládaèov a Ovládaè poskytujú konzistentné rozhranie pre Databázový Systém.

source: This is the main configuration file for ODBC. It contains Data Source configuration. It is used by the Driver Manager to determine, from a given Data Source Name, such things as the name of the Driver. It is a simple text file but is configured using the ODBCConfig tool. The User data sources are typically stored in ~/.odbc.ini while the System data sources are stored in /etc/odbc.ini
sk: Toto je hlavný konfiguraèný súbor pre ODBC. Poskytuje nastavenie Zdrojov Dát. Je pou¾ívaný Mana¾érom Ovládaèov na rozpoznanie Mena Zdroja Dát (myslí sa meno Ovládaèa). Je to jednoduchý textový súbor, ale je pou¾ívaný na nastavenie ODBCConfig nástroja. U¾ívateµské dátové zdroje sú typicky umiestnené v ~/.odbc.ini, pokým Systémovédátové zdroje sú umiestnenécal/etc/odbc.ini

source: This is the program you are using now. This program allows the user to easily configure ODBC.
sk: Je to program, ktorý práve pou¾ívate. Tento program povoµuje u¾ívateµovijednoduché nastavovanie ODBC.

source: odbcinst.ini contains a list of all installed ODBC Drivers. Each entry also contains some information about the driver such as the file name(s) of the driver. An entry should be made when an ODBC driver is installed and removed when the driver is uninstalled. This can be done using ODBCConfig or the odbcinst command tool.
sk: odbcinst.ini poskytuje zoznam v¹etkých nain¹talovaných ODBC Ovládaèov. Ka¾dá polo¾ka tie¾ poskytuje niekoµko informácií o ovládaèi, ako je napr. meno súboru(ov) ovládaèa. Polo¾ka mô¾e by» vytvorená pri in¹talácii ODBC Ovládaèa a vymazaná pri jeho odobratí.Toto mô¾e by» nastavené pou¾ívaním ODBCConfig alebo odbcinst príkazovým nástrojom.

source: ODBCConfig - Credits
sk: ODBCConfig - Poskytuje

source: unixODBC consists of the following components - Driver Manager - GUI Data Manager - GUI Config - Several Drivers and Driver Config libs - Driver Code Template - Driver Config Code Template - ODBCINST lib - odbcinst (command line tool for install scripts) - INI lib - LOG lib - LST lib - TRE lib - SQI lib - isql (command line tool for SQL) All code is released under GPL and the LGPL license.
sk: unixODBC sa skladá z nasledujúcich èastí - Mana¾ér Ovládaèov - GUI Mana¾ér Dát - GUI Konfigurátor - Niekoµko Ovládaèov a Konfiguraèné kni¾nice - ©ablónu Kódu Ovládaèa - ©ablónu Kódu Konfigurátora - ODBCINST lib - odbcinst (nástroj príkazového riadku na in¹taláciu skriptov) - INI lib - LOG lib - LST lib - TRE lib - SQI lib - isql (nástroj príkazového riadku pre SQL) V¹etok kód je vydávaný pod GPL a LGPL licenciami.

source: gODBCConfig - New Driver
sk: gODBCConfig - Nový Ovládaè

source: FileUsage
sk: Pou¾itieSúboru

source: Setup
sk: Nastavenie

source: gODBCConfig - Configure Driver
sk: gODBCConfig - Nastai» Ovládaè

source: gODBCConfig - Add DSN
sk: gODBCConfig - Prida» DSN

source: Select the DRIVER to use or Add a new one
sk: Vyberte OVLÁDAÈ, ktorý chcete pou¾i» alebo Pridajte nov

source: Could not load %s
sk: Nemô¾em naèíta» %s

source: Could not write to (%s)
sk: Nemô¾em zapisova» do (%s)

source: Select a driver to remove
sk: Vyberte ovládaè, ktorý chcete odstráni»

source: Select a driver to configure
sk: Vyberte ovládaè, ktorý chcete nastavi»

source: Enter a DSN name
sk: Vlo¾te DSN meno

source: Could not construct a property list for (%s)
sk: Nemô¾em vytvori» zoznam vlastností pre (%s)

source: Select a driver to Use
sk: Vyberte ovládaè, ktorý chcete pou¾í»

source: Select a DSN to configure
sk: Vyberte DSN, ktorý chcete nastavi»

source: Unable to find a Driver line for this entry
sk: Nemô¾em nájs» riadok Ovládaèa pre túto polo¾ku

source: Select File
sk: Vyberte Súbor

source: Select a DSN to Remove
sk: Vyberte DSN, ktorý chcete Vymaza»

source: Could not write property list for (%s)
sk: Nemô¾em zapísa» zoznam nastavení pre (%s)

source: Could not write to %s
sk: Nemô¾em zapisova» do %s

source: Couldn't find pixmap file: %s
sk: Nemô¾em nájs» pixmap súbor: %s

source: Couldn't create pixmap from file: %s
sk: Nemô¾em vytvori» pixmap pre: %s
